#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

//int main()
//{
//	unsigned int a = 0;
//	for (a = 9; a >= 0; a--)
//	{
//		printf("%u\n", a);//死循环
//
//	}
//	char arr[1000];
//	int i = 0;
//	for (i = 0; i < 1000; i++)
//	{
//		arr[i] = -1 - i;
//	}
//	printf("%d\n", strlen(arr));//255 会放1000个数 由-128到127 中的数字，但遇到0就停下来了，\0的ascll码值是0 换成int 是随机值
//	return 0;
//	}//unsigned char 范围是0-255 char 范围是-128 -127
//float 的类型如何存储的
//float p =5.5；
//101.1 换成二进制 这是m 1.011
//（-1）^0 表示正数 
//2*2
//（-1）^0 *1.011*2^2
//0 10000001 八个位（2+127）01100000000000000000000

int main()
{
	int n = 9;
	//  0 00000000 00000000 00000000 0001001
	float *p = (float*)&n;

	printf("%d\n", n);//9
	printf("%f\n", *p);//以浮点数的形式看待，-1）^0 * 00000000 00000000000000001001 = (-1)^0*0.0000000000000001001*2^-126

	*p = 9.0;
	//1001.0 -1)^0*1.001*2^3  0 10000010 001000000000000000000 补码 还要变成源码 不过高位是0 正数 相同
	printf("%d\n", n);//
	printf("%f\n", *p);


	return 0;
}